In [20]:
import pandas as pd
score = [[34,67,87,90],[68,98,58,89],[75,73,86,100],[94,59,81,99]]
name = ['小明','小红','小李',"小陈"]
course = ['语文','数学','英语','政治']
mydata1 = pd.DataFrame(data=score,columns=name,index=course)#指定行名（index）和列名（columns）
print(mydata1)
mydata2 = pd.DataFrame(score)#不指定行列名，#采用默认行列名使用0,1,2……
print(mydata2)

    小明  小红  小李   小陈
语文  34  67  87   90
数学  68  98  58   89
英语  75  73  86  100
政治  94  59  81   99
    0   1   2    3
0  34  67  87   90
1  68  98  58   89
2  75  73  86  100
3  94  59  81   99

# 抽取行

# 例1.抽取1行数据

In [21]:
#以下用.loc[]抽取1行名为‘语文'的数据（包括所有列）

mydata1.loc['语文',:]

小明    34
小红    67
小李    87
小陈    90
Name: 语文, dtype: int64

# 例2.指定行名抽取任意多行数据

In [22]:
mydata1.loc[["数学",'语文'],:]

    小明  小红  小李  小陈
数学  68  98  58  89
语文  34  67  87  90

# 例3.抽取连续任意多行数据

In [23]:
mydata1.loc[["语文","英语"],:] #连续抽取从语文到英语的所有行

    小明  小红  小李   小陈
语文  34  67  87   90
英语  75  73  86  100

# 抽取“列”的各种情况

# 例子1.抽取1列数据

In [24]:
mydata1.loc[:,"小明"]

语文    34
数学    68
英语    75
政治    94
Name: 小明, dtype: int64

# 例子2.抽取多列数据

In [25]:
mydata1.loc[:,['小明','小红']] #所有行，小明和小红两列

    小明  小红
语文  34  67
数学  68  98
英语  75  73
政治  94  59

# 例子3: #连续抽取从小明列开始到最后一列

In [27]:
mydata1.loc[:,'小红':]

    小红  小李   小陈
语文  67  87   90
数学  98  58   89
英语  73  86  100
政治  59  81   99

# 同时抽取指定行和列对应数据

In [28]:
mydata1.loc['语文','小明'] #输入了两个参数，输出语文行小明列，即一个数据

34

In [29]:
mydata1.loc[['语文','数学'],['小明']] #输出语文数学行，小明列的数据

    小明
语文  34
数学  68

# iloc 用法
data.iloc[i,j]# 第i行  第j列数据

In [37]:
mydata1

    小明  小红  小李   小陈
语文  34  67  87   90
数学  68  98  58   89
英语  75  73  86  100
政治  94  59  81   99

# 取单列数据

In [41]:
mydata1.iloc[:,[0]] # 取第0列的所有行

    小明
语文  34
数学  68
英语  75
政治  94

# 取多列数据

In [42]:
mydata1.iloc[:,[0,3]] # 取第0列 和 第三列的所有行

    小明   小陈
语文  34   90
数学  68   89
英语  75  100
政治  94   99

# 提取连续多列数据

In [60]:
mydata1.iloc[:,0:3] #提取从0列-到-3列数据，默认列从0开始

    小明  小红  小李
语文  34  67  87
数学  68  98  58
英语  75  73  86
政治  94  59  81

In [64]:
mydata1.iloc[:,1:3] #提取从0列-到-3列数据，默认列从0开始

    小红  小李
语文  67  87
数学  98  58
英语  73  86
政治  59  81

# 提取指定行和 指定列的数据

In [53]:
mydata1.iloc[[0,2],[0,1]] #提取第0，2行，第0，1列

    小明  小红
语文  34  67
英语  75  73